#Дано два числа a и b. Выведи гипотенузу треугольника с заданными катетами.
a=int(input("введите число"))
b=int(input("введите число"))
c=(a**2)+(b**2)
print(c)